#!/usr/bin/env python3

from morphgnt.utils import load_yaml, sorted_items

lexemes = load_yaml("lexemes.yaml")

# skip these for now until we work out how to handle them
SKIP = [
    "ἄκων", "ἀμήτωρ", "ἀνθρωποκτόνος", "ἀπάτωρ", "ἀπελεύθερος", "ἄραφος",
    "Ἄρειος", "ἅρπαξ", "αὐτόχειρ", "δεῖνα", "δέκα", "δεκαοκτώ", "δεκαπέντε",
    "δεκατέσσαρες", "δύο", "δώδεκα", "ἑβδομήκοντα", "Ἑβραῖος", "Ἑβραΐς",
    "ἑδραῖος", "εἴκοσι(ν)", "εἷς", "ἑκατόν", "ἐλάσσων", "ἐλωΐ", "ἕνδεκα",
    "ἐνενήκοντα", "ἐννέα", "ἕξ", "ἑξήκοντα", "ἑπτά", "εὐθύς", "ἠλί", "ἱερόν",
    "ἱλαστήριον", "ἵλεως", "κακοποιός", "Καλός", "Κορίνθιος", "κόσμιος",
    "λοίδορος", "λοιμός", "μέγας", "μέγιστος", "μείζων", "μέλας", "μηδείς",
    "μισθωτός", "μοιχαλίς", "νεκρός", "νῆστις", "ὀγδοήκοντα", "οἰκεῖος",
    "ὀκτώ", "οὐδείς", "παρείσακτος", "παρόμοιος", "πᾶς", "πάσχα", "πένης",
    "πέντε", "πεντήκοντα", "πετεινόν", "Πισιδία", "πλανήτης", "πλατεῖα",
    "πολύς", "πραΰς", "πτηνόν", "ραββουνι", "ῥακά", "σκυθρωπός", "σπερμολόγος",
    "στεῖρα", "σύζυγος", "συναιχμάλωτος", "συνεργός", "σύντροφος", "ταλιθα",
    "τέσσαρες", "τεσσεράκοντα", "Τραχωνῖτις", "Τρεῖς", "τρεῖς", "τριάκοντα",
    "ὑγιής", "χήρα",
]

for lexeme, metadata in sorted_items(lexemes):
    if "A" not in metadata["pos"]:
        continue

    if "full-citation-form" in metadata and lexeme not in SKIP:
        lexeme = lexeme.split("/")[0]
        citation_form = metadata["full-citation-form"]
        print("{}: {}".format(lexeme, citation_form))
        for alt in citation_form.split(" / "):
            components = alt.split(", ")
            assert len(components) in [2, 3]
            assert citation_form.endswith((
                "ος, ον",
                "ός, όν",
                "ης, ες",
                "ής, ες",
                "ής, ές",
                "ων, ον",
                "ής, ές, gen. οῦς",
                "ής, ές, οῦς",
                "ην, εν, gen. ενος",
                "ων, ον, gen. ονος",
                "πους, ουν, gen. ποδος",

                "ος, η, ον",
                "ός, ή, όν",
                "ος, α, ον",
                "ός, ά, όν",
                "ος, έρα, ον",
                "οι, αι, α",
                "ας, ασα, αν",
                "οῦς, ῆ, οῦν",
                "οῦς, ᾶ, οῦν",
                "ύς, εῖα, ύ",
                "ών, οῦσα, όν",
                "υς, εια, υ",
                "τερος, τέρα, ον",
            ))
