#!/usr/bin/env python3

import re
import unicodedata

from morphgnt.utils import load_yaml, sorted_items

lexemes = load_yaml("lexemes.yaml")

ACUTE = u"\u0301"
GRAVE = u"\u0300"
CIRCUMFLEX = u"\u0342"


def strip_accents(w):
    return "".join(
        unicodedata.normalize("NFC", "".join(
            component
            for component in unicodedata.normalize("NFD", ch)
            if component not in [ACUTE, GRAVE, CIRCUMFLEX]
        )) for ch in w
    )

SKIP = [

    ## missing full citation

    "αἴτιον",
    "ἀκμήν",
    "ἁλληλουϊά",
    "ἀμήτωρ",
    "ἀπάτωρ",
    "ἀπελεύθερος",
    "ἅρπαξ",
    "αὐτόχειρ",
    "βοηθός",
    "Γαλιλαῖος",
    "Γερασηνός",
    "δέκα",
    "δεκαοκτώ",
    "δεκαπέντε",
    "δεκατέσσαρες",
    "δώδεκα",
    "ἑβδομήκοντα",
    "ἑβδομηκοντάκις",
    "Ἑβραΐς",
    "ἔγγυος",
    "ἔγκυος",
    "εἴκοσι(ν)",
    "ἑκατόν",
    "ἕνδεκα",
    "ἐνενήκοντα",
    "ἐννέα",
    "ἕξ",
    "ἑξήκοντα",
    "ἑπτά",
    "ἔρημος",
    "εφφαθα",
    "ἱερόν",
    "ἱερόσυλος",
    "ἱλαστήριον",
    "κουμ",
    "λεμά",
    "λεπτόν",
    "μίσθιος",
    "μισθωτός",
    "μοιχαλίς",
    "νῆστις",
    "ὀγδοήκοντα",
    "ὀκτώ",
    "πανοῦργος",
    "παραλυτικός",
    "παράσημος",
    "πένης",
    "πέντε",
    "πεντήκοντα",
    "πετεινόν",
    "πλανήτης",
    "πλατεῖα",
    "πρόγονος",
    "σαβαχθάνι",
    "στεῖρα",
    "σύζυγος",
    "συνεργός",
    "τεσσεράκοντα",
    "Τραχωνῖτις",
    "τριάκοντα",
    "χήρα",
    "ὡσαννά",

    ## missing mounce-morphcat

    "ἅλα",
    "ἀλάβαστρος",
    "Ἄψινθος",
    "βάτος",
    "δεσμόν",
    "δύσις",
    "ἦχος",
    "θέρμη",
    "Ἰουνία",
    "Ἰωβήλ",
    "Μαθθαῖος",
    "Μαθθίας",
    "μητρολῴας",
    "νουμηνία",
    "νύμφη",
    "Σαλείμ",
    "σκῦλα",
    "στάδιος",
    "τριετία",
    "χείμαρρος",
    "ψίξ",

    ## problematic without changes to lexemes.yaml

    "δοῦλος",
    "θρίξ",
    "Ἱεροσόλυμα",
    "Ἰσκαριώτης",
    "μέλαν",
    "Μωϋσῆς",
    "Σολομών",
]

MATCHES = [
    (r"^(\w+)[ειϊρ]α, ας, ἡ$",      r"^n-1a$",         r"^N:F$"),
    (r"^(\w+)[ειϊρ]α, ας, ἡ$",      r"^n-1a$",         r"^$"),  # @@@
    (r"^(\w+)[νθὑφκο]α, ας, ἡ$",    r"^n-1a$",         r"^N:F$"),
    (r"^(\w+)[νθὑφκο]α, ας, ἡ$",    r"^n-1a$",         r"^$"),  # @@@
    (r"^(\w+)[ειϊρ]α, ας, ἡ$",      r"^n-1a$",         r"^N:F,N:N$"),  # @@@
    (r"^(\w+)[ειϊρ]α, ας, ἡ$",      r"^n-1a$",         r"^N:F,N-PRI$"),  # @@@
    (r"^(\w+)ος, ου, ὁ$",           r"^n-1a$",         r"^N:M$"),  # @@@
    (r"^(\w+)[ειϊρ]αι, ων, αἱ$",    r"^n-1a$",         r"^N:F$"),  # plural

    (r"^(\w+)η, ης, ἡ$",            r"^n-1b$",         r"^N:F$"),
    (r"^(\w+)η, ης, ἡ$",            r"^n-1b$",         r"^$"),  # @@@
    (r"^(\w+)αι, ων, αἱ$",          r"^n-1b$",         r"^N:F$"),  # plural
    (r"^(\w+)υς, υος, ὁ$",          r"^n-1b$",         r"^N:M$"),  # @@@

    (r"^(\w+)α, ης, ἡ$",            r"^n-1c$",         r"^N:F$"),
    (r"^(\w+)α, το$",               r"^n-1c$",         r"^$"),  # @@@
    (r"^(\w+)αι, ων, αἱ$",          r"^n-1c$",         r"^N:F$"),  # plural

    (r"^(\w+)[ειϊῳ]ας, ου, ὁ$",     r"^n-1d$",         r"^N:M$"),

    (r"^(\w+)ας, α, ὁ$",            r"^n-1e$",         r"^N:M$"),
    (r"^(\w+)ας, α, ὁ$",            r"^n-1e$",         r"^$"),  # @@@

    (r"^(\w+)ης, ου, ὁ$",           r"^n-1f$",         r"^N:M$"),
    (r"^(\w+)ης, ου, ὁ$",           r"^n-1f$",         r"^$"),  # @@@
    (r"^(\w+)ης, ητος, ἡ$",         r"^n-1f$",         r"^N:F$"),

    (r"^(\w+)η, \1ης, ἡ$",          r"^n-1h$",         r"^N:F$"),
    (r"^(\w+)η, ης, ἡ$",            r"^n-1h$",         r"^N:F$"),
    (r"^(\w+)α, ας, ἡ$",            r"^n-1h$",         r"^N:F$"),
    (r"^(\w+)ης, ου, ὁ$",           r"^n-1h$",         r"^N:M$"),
    (r"^(\w+)αι, ων, αἱ$",          r"^n-1h$",         r"^N:F$"),  # plural

    (r"^(\w+)ος, ου, ὁ$",           r"^n-2a$",         r"^N:M$"),
    (r"^(\w+)ος, ου, ὁ$",           r"^n-2a$",         r"^N:M,N:N$"),  # @@@
    (r"^(\w+)ος, ου, ὁ$",           r"^n-2a$",         r"^A$"),  # @@@
    (r"^(\w+)ος, ου, ὁ$",           r"^n-2a$",         r"^$"),  # @@@
    (r"^(\w+)ος, ου, ὁ/ἡ$",         r"^n-2a$",         r"^N:F,N:M$"),  # @@@
    (r"^(\w+)ος, ου, ἡ$",           r"^n-2a$",         r"^N:F,N:M$"),  # @@@
    (r"^(\w+)οι, ων, οἱ$",          r"^n-2a$",         r"^N:M$"),  # plural
    (r"^(\w+)ος, ους, το$",         r"^n-2a$",         r"^N:N$"),  # @@@
    (r"^(\w+)ος, ου, ὁ/ἡ$",         r"^n-2a$",         r"^N:F$"),  # @@@
    (r"^(\w+)ος, ου, ὁ/ἡ$",         r"^n-2a$",         r"^N:M$"),  # @@@
    (r"^(\w+)ος, ου, ἡ$",           r"^n-2a$",         r"^N:F$"),  # @@@
    (r"^(\w+)ος, ου, ὁ/το$",        r"^n-2a$",         r"^N:M,N:N$"),  # @@@

    (r"^(\w+)ος, ου, ἡ$",           r"^n-2b$",         r"^N:F$"),
    (r"^(\w+)ος, ου, ὁ/ἡ$",         r"^n-2b$",         r"^N:F$"),  # @@@
    (r"^(\w+)ος, ου, ὁ$",           r"^n-2b$",         r"^N:F$"),
    (r"^(\w+)ος, ον, ἡ$",           r"^n-2b$",         r"^N:F$"),  # @@@ typo?
    (r"^(\w+)ος, ου, ὁ/ἡ$",         r"^n-2b$",         r"^N:M$"),

    (r"^(\w+)ον, ου, το$",          r"^n-2c$",         r"^N:N$"),
    (r"^(\w+)ον, ου, το$",          r"^n-2c$",         r"^$"),  # @@@
    (r"^(\w+)α, ων, τα$",           r"^n-2c$",         r"^N:N$"),  # plural
    (r"^(\w+)α, ων, τα$",           r"^n-2c$",         r"^N:F,N:N$"),  # @@@ plural
    (r"^(\w+)ον, ου, το$",          r"^n-2c$",         r"^N:F$"),  # @@@
    (r"^(\w+)ον, ου, το$",          r"^n-2c$",         r"^N:M,N:N$"),  # @@@

    (r"^(\w+)ους, ου, ὁ$",          r"^n-2d\(1\)$",    r"^N:M$"),

    (r"^(\w+)ως, ω, ὁ$",            r"^n-2e$",         r"^N:M$"),

    (r"^(\w+)οψ, οπος, ὁ$",         r"^n-3a\(1\)$",    r"^N:M$"),
    (r"^(\w+)ωψ, ωπος, ὁ$",         r"^n-3a\(1\)$",    r"^N:M$"),
    (r"^(\w+)αψ, απος, ἡ$",         r"^n-3a\(1\)$",    r"^N:F$"),

    (r"^(\w+)αψ, αβος, ὁ$",         r"^n-3a\(2\)$",    r"^N:M$"),
    (r"^(\w+)ιψ, \1ιβος, ὁ$",       r"^n-3a\(2\)$",    r"^N:M$"),

    (r"^(\w+)αξ, ακος, ὁ$",         r"^n-3b\(1\)$",    r"^N:M$"),
    (r"^(\w+)αξ, \1ακος, ἡ$",       r"^n-3b\(1\)$",    r"^N:F$"),  # @@@
    (r"^(\w+)ηξ, εκος, ἡ$",         r"^n-3b\(1\)$",    r"^N:F$"),
    (r"^(\w+)υξ, υκος, ὁ$",         r"^n-3b\(1\)$",    r"^N:M$"),
    (r"^(\w+)η, αικος, ἡ$",         r"^n-3b\(1\)$",    r"^N:F$"),
    (r"^(\w+)ρξ, \1ρκος, ἡ$",       r"^n-3b\(1\)$",    r"^N:F$"),
    (r"^(\w+)ηξ, ηκος, ὁ$",         r"^n-3b\(1\)$",    r"^N:M$"),
    (r"^(\w+)ιξ, ικος, ὁ$",         r"^n-3b\(1\)$",    r"^N:M$"),
    (r"^(\w+)ιξ, ικος, ἡ$",         r"^n-3b\(1\)$",    r"^N:F$"),

    (r"^(\w+)ιξ, ιγος, ἡ$",         r"^n-3b\(2\)$",    r"^N:F$"),
    (r"^(\w+)οξ, \1ογος, ἡ$",       r"^n-3b\(2\)$",    r"^N:F$"),
    (r"^(\w+)γξ, γγος, ὁ$",         r"^n-3b\(2\)$",    r"^N:M$"),
    (r"^(\w+)υξ, υγος, ἡ$",         r"^n-3b\(2\)$",    r"^N:F$"),
    (r"^(\w+)ιγξ, ιγγος, ἡ$",       r"^n-3b\(2\)$",    r"^N:F$"),
    (r"^(\w+)αγξ, αγγος, ἡ$",       r"^n-3b\(2\)$",    r"^N:F$"),
    (r"^(\w+)ος, ους, το$",         r"^n-3b\(2b\)$",   r"^N:N$"),

    (r"^(\w+)υξ, υχος, ὁ$",         r"^n-3b\(3\)$",    r"^N:M$"),

    (r"^(\w+)ης, ητος, ἡ$",         r"^n-3c\(1\)$",    r"^N:F$"),
    (r"^(\w+)ης, ητος, ὁ$",         r"^n-3c\(1\)$",    r"^N:M$"),
    (r"^(\w+)ως, ωτος, ὁ$",         r"^n-3c\(1\)$",    r"^N:M$"),
    (r"^(\w+)υξ, \1υκτος, ἡ$",      r"^n-3c\(1\)$",    r"^N:F$"),
    (r"^(\w+)της, τητος, ἡ$",       r"^n-3c\(1\)$",    r"^N:F$"),
    (r"^(\w+)ης, \1ητος, ὁ$",       r"^n-3c\(1\)$",    r"^N:M$"),
    (r"^(\w+)ις, ιτος, ἡ$",         r"^n-3c\(1\)$",    r"^N:F$"),

    (r"^(\w+)ις, ιδος, ἡ$",         r"^n-3c\(2\)$",    r"^N:F$"),
    (r"^(\w+)υς, υδος, ἡ$",         r"^n-3c\(2\)$",    r"^N:F$"),
    (r"^(\w+)ις, δος, ἡ$",          r"^n-3c\(2\)$",    r"^N:F$"),
    (r"^(\w+)ας, αδος, ἡ$",         r"^n-3c\(2\)$",    r"^N:F$"),
    (r"^(\w+)ϊς, ϊδος, ἡ$",         r"^n-3c\(2\)$",    r"^N:F$"),
    (r"^(\w+)ας, αδος, ἡ$",         r"^n-3c\(2\)$",    r"^$"),
    (r"^(\w+)ις, \1ιδος, ὁ/ἡ$",     r"^n-3c\(2\)$",    r"^N:F,N:M$"),
    (r"^(\w+)ους, \1οδος, ὁ$",      r"^n-3c\(2\)$",    r"^N:M$"),
    (r"^(\w+)ις, ιδος, ἡ$",         r"^n-3c\(2\)$",    r"^A$"),  # @@@

    (r"^(\w+)ις, ιθος, ὁ/ἡ$",       r"^n-3c\(3\)$",    r"^N:F$"),

    (r"^(\w+)μα, ατος, το$",        r"^n-3c\(4\)$",    r"^N:N$"),
    (r"^(\w+)μα, ατος, το$",        r"^n-3c\(4\)$",    r"^$"),
    (r"^(\w+)μα, τος, το$",         r"^n-3c\(4\)$",    r"^N:N$"),

    (r"^(\w+)ας, αντος, ὁ$",        r"^n-3c\(5a\)$",   r"^N:M$"),
    (r"^(\w+)ης, εντος, ὁ$",        r"^n-3c\(5a\)$",   r"^N:M$"),
    (r"^(\w+)ους, οντος, ὁ$",       r"^n-3c\(5a\)$",   r"^N:M$"),

    (r"^(\w+)ων, οντος, ὁ$",        r"^n-3c\(5b\)$",   r"^N:M$"),
    (r"^(\w+)ων, ωντος, ὁ$",        r"^n-3c\(5b\)$",   r"^N:M$"),

    (r"^(\w+)ας, ατος, το$",        r"^n-3c\(6a\)$",   r"^N:N$"),

    (r"^(\w+)ωρ, ατος, το$",        r"^n-3c\(6b\)$",   r"^N:N$"),
    (r"^(\w+)αρ, ατος, το$",        r"^n-3c\(6b\)$",   r"^N:N$"),

    (r"^οὐς, ὠτος, το$",            r"^n-3c\(6c\)$",   r"^N:N$"),
    (r"^φως, φωτος, το$",           r"^n-3c\(6c\)$",   r"^N:N$"),

    (r"^(\w+)υ, ατος, το$",         r"^n-3c\(6d\)$",   r"^N:N$"),
    (r"^(\w+)α, ακτος, το$",        r"^n-3c\(6d\)$",   r"^N:N$"),
    (r"^(\w+)ι, ιτος, το$",         r"^n-3c\(6d\)$",   r"^N:N$"),

    (r"^(\w+)ης, ους, ὁ$",          r"^n-3d\(2a\)$",   r"^N:M$"),

    (r"^(\w+)ος, ους, το$",         r"^n-3d\(2b\)$",   r"^N:N$"),
    (r"^(\w+)ος, ους, το$",         r"^n-3d\(2b\)$",   r"^$"),  # @@@
    (r"^(\w+)ος, ους, το$",         r"^n-3d\(2b\)$",   r"^N:M,N:N$"),  # @@@

    (r"^(\w+)ως, ους, ἡ$",          r"^n-3d\(3\)$",    r"^N:F$"),

    (r"^(\w+)υς, υος, ὁ$",          r"^n-3e\(1\)$",    r"^N:M$"),
    (r"^(\w+)υς, υος, ἡ$",          r"^n-3e\(1\)$",    r"^N:F$"),
    (r"^(\w+)υς, εως, ὁ$",          r"^n-3e\(1\)$",    r"^N:M$"),
    (r"^ὑς, ὑος, ἡ$",               r"^n-3e\(1\)$",    r"^N:F$"),

    (r"^(\w+)ις, εως, ἡ$",          r"^n-3e\(2b\)$",   r"^N:F$"),
    (r"^(\w+)ευς, εως, ὁ$",         r"^n-3e\(3\)$",    r"^N:M$"),
    (r"^(\w+)ους, \1οος, ὁ$",       r"^n-3e\(4\)$",    r"^N:M$"),

    (r"^(\w+)ις, εως, ἡ$",          r"^n-3e\(5a\)$",   r"^N:F$"),

    (r"^(\w+)ις, εως, ἡ$",          r"^n-3e\(5b\)$",   r"^N:F$"),
    (r"^(\w+)ις, εως, ὁ$",          r"^n-3e\(5b\)$",   r"^N:M$"),
    (r"^(\w+)ις, εως, ἡ$",          r"^n-3e\(5b\)$",   r"^$"),  # @@@
    (r"^(\w+)εις, εων, αἱ$",        r"^n-3e\(5b\)$",   r"^N:F$"),  # plural
    (r"^(\w+)ι, εως, το$",          r"^n-3e\(5b\)$",   r"^N:N$"),

    (r"^(\w+)ων, ωνος, ὁ$",         r"^n-3f\(1a\)$",   r"^N:M$"),
    (r"^(\w+)ων, ωνος, ἡ$",         r"^n-3f\(1a\)$",   r"^N:F$"),
    (r"^(\w+)ην, ηνος, ὁ$",         r"^n-3f\(1a\)$",   r"^N:M$"),
    (r"^(\w+)ην, \1ηνος, ὁ$",       r"^n-3f\(1a\)$",   r"^N:M$"),
    (r"^(\w+)ων, ωνος, ὁ$",         r"^n-3f\(1a\)$",   r"^$"),  # @@@
    (r"^(\w+)ων, ωνος, ἡ$",         r"^n-3f\(1a\)$",   r"^N:F,N:M$"),
    (r"^(\w+)αν, ανος, ὁ$",         r"^n-3f\(1a\)$",   r"^N:M$"),
    (r"^(\w+)ις, ινος, ἡ$",         r"^n-3f\(1a\)$",   r"^N:F$"),
    (r"^(\w+)ιν, ινος, ἡ$",         r"^n-3f\(1a\)$",   r"^N:F$"),

    (r"^(\w+)ων, ονος, ὁ$",         r"^n-3f\(1b\)$",   r"^N:M$"),
    (r"^(\w+)ην, ενος, ὁ$",         r"^n-3f\(1b\)$",   r"^N:M$"),
    (r"^(\w+)ην, \1ενος, ἡ$",       r"^n-3f\(1b\)$",   r"^N:F$"),
    (r"^(\w+)ων, ονος, ὁ/ἡ$",       r"^n-3f\(1b\)$",   r"^N:F,N:M$"),
    (r"^(\w+)ων, ονος, ἡ$",         r"^n-3f\(1b\)$",   r"^N:F$"),

    (r"^(\w+)ην, \1νος, ὁ$",        r"^n-3f\(1c\)$",   r"^N:M$"),
    (r"^(\w+)ων, \1νος, ὁ$",        r"^n-3f\(1c\)$",   r"^N:M$"),

    (r"^(\w+)αρ, αρος, ὁ$",         r"^n-3f\(2a\)$",   r"^N:M$"),
    (r"^(\w+)υς, υρος, ὁ$",         r"^n-3f\(2a\)$",   r"^N:M$"),
    (r"^(\w+)ηρ, ηρος, ὁ$",         r"^n-3f\(2a\)$",   r"^N:M$"),
    (r"^(\w+), ος, το$",            r"^n-3f\(2a\)$",   r"^N:N$"),
    (r"^(\w+)ειρ, \1ειρος, ἡ$",     r"^n-3f\(2a\)$",   r"^N:F$"),

    (r"^(\w+)ωρ, ορος, ὁ$",         r"^n-3f\(2b\)$",   r"^N:M$"),
    (r"^(\w+)ωρ, ορος, ὁ$",         r"^n-3f\(2b\)$",   r"^$"),
    (r"^(\w+)ηρ, ερος, ὁ$",         r"^n-3f\(2b\)$",   r"^N:M$"),
    (r"^(\w+)ηρ, \1ερος, ὁ$",       r"^n-3f\(2b\)$",   r"^N:M$"),  # @@@

    (r"^(\w+)τηρ, \1τρος, ὁ$",      r"^n-3f\(2c\)$",   r"^N:M$"),
    (r"^(\w+)τηρ, τρος, ἡ$",        r"^n-3f\(2c\)$",   r"^N:F$"),
    (r"^(\w+)ηρ, \1δρος, ὁ$",       r"^n-3f\(2c\)$",   r"^N:M$"),

    (r"^(\w+)α, α, ὁ$",             r"^n-3g\(2\)$",    r"^$"),  # @@@
]

success_count = 0
fail_count = 0
first_fail = None

for lexeme, metadata in sorted_items(lexemes):
    pos = metadata.get("pos")
    full_citation = metadata.get("full-citation-form")
    dodson_pos = metadata.get("dodson-pos", "")
    mounce_morphcat = metadata.get("mounce-morphcat", "")

    if (
        pos == "N" or
        (dodson_pos and dodson_pos.startswith("N")) or
        (
            isinstance(mounce_morphcat, str) and
            mounce_morphcat.startswith("n")
        ) or (
            isinstance(mounce_morphcat, list) and
            any(x.startswith("n") for x in mounce_morphcat)
        )
    ):

        if lexeme in SKIP:
            continue

        if not re.match(r"(\w+), (\w+), (\w+)$", full_citation):
            continue

        if isinstance(mounce_morphcat, list):
            mounce_morphcat = ";".join(mounce_morphcat)
        success = False

        for end, cat, dodson in MATCHES:
            if (
                full_citation and mounce_morphcat and
                re.search(end, strip_accents(full_citation)) and
                re.search(cat, mounce_morphcat) and
                re.search(dodson, dodson_pos)
            ):
                success = True
        if success:
            success_count += 1
        else:
            fail_count += 1
            if not first_fail:
                first_fail = '(r"^{}$", r"^{}$", r"^{}$"),  # {} '.format(
                    strip_accents(full_citation),
                    mounce_morphcat, dodson_pos, lexeme)

print(success_count, fail_count)
print(first_fail)
