#!/usr/bin/env python3

import re
import unicodedata

from morphgnt.utils import load_yaml, sorted_items

lexemes = load_yaml("lexemes.yaml")

ACUTE = u"\u0301"
GRAVE = u"\u0300"
CIRCUMFLEX = u"\u0342"


def strip_accents(w):
    return "".join(
        unicodedata.normalize("NFC", "".join(
            component
            for component in unicodedata.normalize("NFD", ch)
            if component not in [ACUTE, GRAVE, CIRCUMFLEX]
        )) for ch in w
    )

SKIP = [

    ## missing full citation

    "αἴτιον",
    "ἀκμήν",
    "ἁλληλουϊά",
    "ἀμήτωρ",
    "ἀπάτωρ",
    "ἀπελεύθερος",
    "ἅρπαξ",
    "αὐτόχειρ",
    "βοηθός",
    "Γαλιλαῖος",
    "Γερασηνός",
    "δέκα",
    "δεκαοκτώ",
    "δεκαπέντε",
    "δεκατέσσαρες",
    "δώδεκα",
    "ἑβδομήκοντα",
    "ἑβδομηκοντάκις",
    "Ἑβραΐς",
    "ἔγγυος",
    "ἔγκυος",
    "εἴκοσι(ν)",
    "ἑκατόν",
    "ἕνδεκα",
    "ἐνενήκοντα",
    "ἐννέα",
    "ἕξ",
    "ἑξήκοντα",
    "ἑπτά",
    "ἔρημος",
    "εφφαθα",
    "ἱερόν",
    "ἱερόσυλος",
    "ἱλαστήριον",
    "κουμ",
    "λεμά",
    "λεπτόν",
    "μίσθιος",
    "μισθωτός",
    "μοιχαλίς",
    "νῆστις",
    "ὀγδοήκοντα",
    "ὀκτώ",
    "πανοῦργος",
    "παραλυτικός",
    "παράσημος",
    "πένης",
    "πέντε",
    "πεντήκοντα",
    "πετεινόν",
    "πλανήτης",
    "πλατεῖα",
    "πρόγονος",
    "σαβαχθάνι",
    "στεῖρα",
    "σύζυγος",
    "συνεργός",
    "τεσσεράκοντα",
    "Τραχωνῖτις",
    "τριάκοντα",
    "χήρα",
    "ὡσαννά",

    ## missing mounce-morphcat

    "ἅλα",
    "ἀλάβαστρος",
    "Ἄψινθος",
    "βάτος",
    "δεσμόν",
    "δύσις",
    "ἦχος",
    "θέρμη",
    "Ἰουνία",
    "Ἰωβήλ",
    "Μαθθαῖος",
    "Μαθθίας",
    "μητρολῴας",
    "νουμηνία",
    "νύμφη",
    "Σαλείμ",
    "σκῦλα",
    "στάδιος",
    "τριετία",
    "χείμαρρος",
    "ψίξ",

    ## problematic without changes to lexemes.yaml

    "δοῦλος",
    "θρίξ",
    "Ἱεροσόλυμα",
    "Ἰσκαριώτης",
    "μέλαν",
    "Μωϋσῆς",
    "Σολομών",
    "ζῆλος",
    "τιμιότης",
    "Ταρσός",
    "Βαριησοῦς",
    "λεγιών",
    "Βαριωνᾶ",
]

DODSON_OVERRIDES = {
    "ἀφθορία":       "N:F",
    "δοκιμασία":     "N:F",
    "εἰδέα":         "N:F",
    "οἰκετεία":      "N:F",
    "ὀλιγοπιστία":   "N:F",
    "πραϋπαθία":     "N:F",
    "Εὕα":           "N:F",
    "κοπρία":        "N:F",
    "Μαρία":         "N:F",

    "βελόνη":        "N:F",
    "διαπαρατριβή":  "N:F",
    "ἐμπαιγμονή":    "N:F",
    "καταδίκη":      "N:F",
    "ὁμίχλη":        "N:F",

    "κορβανᾶς":      "N:M",

    "Ζηλωτής":       "N:M",
    "προσαίτης":     "N:M",
    "στασιαστής":    "N:M",

    "ἄμωμον":        "N:N",  # but Heb 9.14
    "ἀνάγαιον":      "N:N",
    "κλινάριον":     "N:N",
    "κόπριον":       "N:N",
    "σιτίον":        "N:N",
    "φάρμακον":      "N:N",
    "ὠτάριον":       "N:N",
    "δυσεντέριον":   "N:N",
    "Σόδομα":        "N:N",
    "στάδιον":       "N:N",

    "ἀνθρωποκτόνος": "N:M",
    "Ἑβραῖος":       "N:M",
    "ἑκατόνταρχος":  "N:M",
    "ἐλεγμός":       "N:M",
    "Καναναῖος":     "N:M",
    "Κορίνθιος":     "N:M",
    "κυλισμός":      "N:M",
    "λοίδορος":      "N:M",
    "νοσσός":        "N:M",
    "οἰκιακός":      "N:M",
    "οἰκοδόμος":     "N:M",
    "Πύρρος":        "N:M",
    "συναιχμάλωτος": "N:M",
    "Τίτιος":        "N:M",
    "σῖτος":         "N:M",

    "ἄψινθος":       "N:F",

    "δισμυριάς":     "N:F",
    "στιβάς":        "N:F",
    "συγγενίς":      "N:F",
    "διόρθωμα":      "N:N",
    "τρῆμα":         "N:N",
    "ὑπόλειμμα":     "N:N",
    "ἄγγος":         "N:N",
    "δέος":          "N:N",
    "ἐκζήτησις":     "N:F",
    "ἔλεος":         "N:N",
    "ἐπίστασις":     "N:F",
    "λῆμψις":        "N:F",
    "μετάλημψις":    "N:F",
    "πρόσκλισις":    "N:F",
    "σκότος":        "N:N",
    "εὐρακύλων":     "N:M",
    "Σαρών":         "N:M",
    "κατήγωρ":       "N:M",
    "προπάτωρ":      "N:M",
}

MOUNCE_OVERRIDES = {
    "Ἀθῆναι":       "n-1c",

    "ζυγός":        "n-2a",
    "ἄψινθος":      "n-2b",
    "Πέργαμος":     "n-2b",

    "θάμβος":       "n-3d(2b)",
    "στάχυς":       "n-3e(1)",
}


MATCHES = [
    (r"^(\w+)[ειϊρ]α, ας, ἡ$",      r"^n-1a$",         r"^N:F$"),
    (r"^(\w+)[^ειϊρ]α, ας, ἡ$",     r"^n-1a$",         r"^N:F$"),
    (r"^(\w+)[ειϊρ]αι, ων, αἱ$",    r"^n-1a$",         r"^N:F$"),  # pl.

    (r"^(\w+)η, ης, ἡ$",            r"^n-1b$",         r"^N:F$"),
    (r"^(\w+)αι, ων, αἱ$",          r"^n-1b$",         r"^N:F$"),  # pl.

    (r"^(\w+)α, ης, ἡ$",            r"^n-1c$",         r"^N:F$"),
    (r"^(\w+)αι, ων, αἱ$",          r"^n-1c$",         r"^N:F$"),  # pl.

    (r"^(\w+)[ειϊῳ]ας, ου, ὁ$",     r"^n-1d$",         r"^N:M$"),

    (r"^(\w+)ας, α, ὁ$",            r"^n-1e$",         r"^N:M$"),

    (r"^(\w+)ης, ου, ὁ$",           r"^n-1f$",         r"^N:M$"),

    (r"^(\w+)η, \1ης, ἡ$",          r"^n-1h$",         r"^N:F$"),  # γῆ
    (r"^(\w+)η, ης, ἡ$",            r"^n-1h$",         r"^N:F$"),  # συκῆ n-1b
    (r"^(\w+)α, ας, ἡ$",            r"^n-1h$",         r"^N:F$"),  # μνᾶ n-1a
    (r"^(\w+)ης, ου, ὁ$",           r"^n-1h$",         r"^N:M$"),  # Ἑρμῆς n-1f

    (r"^(\w+)ος, ου, ὁ$",           r"^n-2a$",         r"^N:M$"),
    (r"^(\w+)οι, ων, οἱ$",          r"^n-2a$",         r"^N:M$"),  # pl.

    (r"^(\w+)ος, ου, ἡ$",           r"^n-2b$",         r"^N:F$"),

    (r"^(\w+)ον, ου, το$",          r"^n-2c$",         r"^N:N$"),
    (r"^(\w+)α, ων, τα$",           r"^n-2c$",         r"^N:N$"),  # pl.

    (r"^(\w+)ως, ω, ὁ$",            r"^n-2e$",         r"^N:M$"),

    (r"^(\w+)([οω])ψ, \2πος, ὁ$",   r"^n-3a\(1\)$",    r"^N:M$"),
    (r"^(\w+)([α])ψ, \2πος, ἡ$",    r"^n-3a\(1\)$",    r"^N:F$"),

    (r"^(\w+)([α])ψ, \2βος, ὁ$",    r"^n-3a\(2\)$",    r"^N:M$"),
    (r"^(\w+)([ι])ψ, \1\2βος, ὁ$",  r"^n-3a\(2\)$",    r"^N:M$"),

    (r"^(\w+)([αυηι])ξ, \2κος, ὁ$", r"^n-3b\(1\)$",    r"^N:M$"),
    (r"^(\w+)([ι])ξ, \2κος, ἡ$",    r"^n-3b\(1\)$",    r"^N:F$"),
    (r"^(\w+)([αρ])ξ, \1\2κος, ἡ$", r"^n-3b\(1\)$",    r"^N:F$"),
    (r"^(\w+)ηξ, εκος, ἡ$",         r"^n-3b\(1\)$",    r"^N:F$"),  # ἀλώπηξ
    (r"^(\w+)η, αικος, ἡ$",         r"^n-3b\(1\)$",    r"^N:F$"),  # γυνή

    (r"^(\w+)(ι|υ|ιγ|αγ)ξ, \2γος, ἡ$", r"^n-3b\(2\)$", r"^N:F$"),
    (r"^(\w+)(ο)ξ, \1\2γος, ἡ$",    r"^n-3b\(2\)$",    r"^N:F$"),
    (r"^(\w+)(γ)ξ, \2γος, ὁ$",      r"^n-3b\(2\)$",    r"^N:M$"),

    (r"^(\w+)ος, ους, το$",         r"^n-3b\(2b\)$",   r"^N:N$"),

    (r"^(\w+)(υ)ξ, \2χος, ὁ$",      r"^n-3b\(3\)$",    r"^N:M$"),

    (r"^(\w+)(ι|η|τη)ς, \2τος, ἡ$", r"^n-3c\(1\)$",    r"^N:F$"),
    (r"^(\w+)(υ)ξ, \1\2κτος, ἡ$",   r"^n-3c\(1\)$",    r"^N:F$"),
    (r"^(\w+)([ηω])ς, \2τος, ὁ$",   r"^n-3c\(1\)$",    r"^N:M$"),
    (r"^(\w+)(η)ς, \1\2τος, ὁ$",    r"^n-3c\(1\)$",    r"^N:M$"),

    (r"^(\w+)([αιϊυ])ς, \2δος, ἡ$", r"^n-3c\(2\)$",    r"^N:F$"),
    (r"^(\w+)ις, δος, ἡ$",          r"^n-3c\(2\)$",    r"^N:F$"),  # κλείς

    (r"^(\w+)ους, \1οδος, ὁ$",      r"^n-3c\(2\)$",    r"^N:M$"),

    (r"^(\w+)μα, ατος, το$",        r"^n-3c\(4\)$",    r"^N:N$"),
    (r"^(\w+)μα, τος, το$",         r"^n-3c\(4\)$",    r"^N:N$"),  # ἁμάρτημα

    (r"^(\w+)ας, αντος, ὁ$",        r"^n-3c\(5a\)$",   r"^N:M$"),
    (r"^(\w+)ης, εντος, ὁ$",        r"^n-3c\(5a\)$",   r"^N:M$"),
    (r"^(\w+)ους, οντος, ὁ$",       r"^n-3c\(5a\)$",   r"^N:M$"),

    (r"^(\w+)ων, οντος, ὁ$",        r"^n-3c\(5b\)$",   r"^N:M$"),
    (r"^(\w+)ων, ωντος, ὁ$",        r"^n-3c\(5b\)$",   r"^N:M$"),

    (r"^(\w+)ας, ατος, το$",        r"^n-3c\(6a\)$",   r"^N:N$"),

    (r"^(\w+)ωρ, ατος, το$",        r"^n-3c\(6b\)$",   r"^N:N$"),
    (r"^(\w+)αρ, ατος, το$",        r"^n-3c\(6b\)$",   r"^N:N$"),

    (r"^οὐς, ὠτος, το$",            r"^n-3c\(6c\)$",   r"^N:N$"),

    (r"^φως, φωτος, το$",           r"^n-3c\(6c\)$",   r"^N:N$"),

    (r"^(\w+)υ, ατος, το$",         r"^n-3c\(6d\)$",   r"^N:N$"),
    (r"^(\w+)α, ακτος, το$",        r"^n-3c\(6d\)$",   r"^N:N$"),
    (r"^(\w+)ι, ιτος, το$",         r"^n-3c\(6d\)$",   r"^N:N$"),

    (r"^(\w+)ης, ους, ὁ$",          r"^n-3d\(2a\)$",   r"^N:M$"),

    (r"^(\w+)ος, ους, το$",         r"^n-3d\(2b\)$",   r"^N:N$"),

    (r"^(\w+)ως, ους, ἡ$",          r"^n-3d\(3\)$",    r"^N:F$"),

    (r"^(\w+)υς, υος, ὁ$",          r"^n-3e\(1\)$",    r"^N:M$"),
    (r"^(\w+)υς, υος, ἡ$",          r"^n-3e\(1\)$",    r"^N:F$"),
    (r"^(\w+)υς, εως, ὁ$",          r"^n-3e\(1\)$",    r"^N:M$"),
    (r"^ὑς, ὑος, ἡ$",               r"^n-3e\(1\)$",    r"^N:F$"),

    (r"^(\w+)ις, εως, ἡ$",          r"^n-3e\(2b\)$",   r"^N:F$"),
    (r"^(\w+)ευς, εως, ὁ$",         r"^n-3e\(3\)$",    r"^N:M$"),
    (r"^(\w+)ους, \1οος, ὁ$",       r"^n-3e\(4\)$",    r"^N:M$"),

    (r"^(\w+)ις, εως, ἡ$",          r"^n-3e\(5a\)$",   r"^N:F$"),

    (r"^(\w+)ις, εως, ἡ$",          r"^n-3e\(5b\)$",   r"^N:F$"),
    (r"^(\w+)ις, εως, ὁ$",          r"^n-3e\(5b\)$",   r"^N:M$"),
    (r"^(\w+)εις, εων, αἱ$",        r"^n-3e\(5b\)$",   r"^N:F$"),  # pl.
    (r"^(\w+)ι, εως, το$",          r"^n-3e\(5b\)$",   r"^N:N$"),

    (r"^(\w+)([αηω])ν, \2νος, ὁ$",  r"^n-3f\(1a\)$",   r"^N:M$"),
    (r"^(\w+)(η)ν, \1\2νος, ὁ$",    r"^n-3f\(1a\)$",   r"^N:M$"),
    (r"^(\w+)([ιω])ν, \2νος, ἡ$",   r"^n-3f\(1a\)$",   r"^N:F$"),
    (r"^(\w+)(ι)ς, \2νος, ἡ$",      r"^n-3f\(1a\)$",   r"^N:F$"),  # Σαλαμίς

    (r"^(\w+)ων, ονος, ὁ$",         r"^n-3f\(1b\)$",   r"^N:M$"),
    (r"^(\w+)ην, ενος, ὁ$",         r"^n-3f\(1b\)$",   r"^N:M$"),
    (r"^(\w+)ην, \1ενος, ἡ$",       r"^n-3f\(1b\)$",   r"^N:F$"),
    (r"^(\w+)ων, ονος, ἡ$",         r"^n-3f\(1b\)$",   r"^N:F$"),

    (r"^(\w+)[ηω]ν, \1νος, ὁ$",     r"^n-3f\(1c\)$",   r"^N:M$"),

    (r"^(\w+)([αη])ρ, \2ρος, ὁ$",   r"^n-3f\(2a\)$",   r"^N:M$"),
    (r"^(\w+)(υ)ς, \2ρος, ὁ$",      r"^n-3f\(2a\)$",   r"^N:M$"),
    (r"^(\w+)ρ, ος, το$",           r"^n-3f\(2a\)$",   r"^N:N$"),
    (r"^(\w+)(ει)ρ, \1\2ρος, ἡ$",   r"^n-3f\(2a\)$",   r"^N:F$"),

    (r"^(\w+)ωρ, ορος, ὁ$",         r"^n-3f\(2b\)$",   r"^N:M$"),
    (r"^(\w+)ηρ, ερος, ὁ$",         r"^n-3f\(2b\)$",   r"^N:M$"),
    (r"^(\w+)ηρ, \1ερος, ὁ$",       r"^n-3f\(2b\)$",   r"^N:M$"),

    (r"^(\w+)τηρ, \1τρος, ὁ$",      r"^n-3f\(2c\)$",   r"^N:M$"),
    (r"^(\w+)τηρ, τρος, ἡ$",        r"^n-3f\(2c\)$",   r"^N:F$"),
    (r"^(\w+)ηρ, \1δρος, ὁ$",       r"^n-3f\(2c\)$",   r"^N:M$"),
]

success_count = 0
fail_count = 0
first_fail = None

for lexeme, metadata in sorted_items(lexemes):
    pos = metadata.get("pos")
    full_citation = metadata.get("full-citation-form")
    dodson_pos = DODSON_OVERRIDES.get(lexeme, metadata.get("dodson-pos", ""))
    mounce_morphcat = MOUNCE_OVERRIDES.get(
        lexeme, metadata.get("mounce-morphcat", ""))

    if (
        pos == "N" or
        (dodson_pos and dodson_pos.startswith("N")) or
        (
            isinstance(mounce_morphcat, str) and
            mounce_morphcat.startswith("n")
        ) or (
            isinstance(mounce_morphcat, list) and
            any(x.startswith("n") for x in mounce_morphcat)
        )
    ):

        if lexeme in SKIP:
            continue

        if not re.match(r"(\w+), (\w+), (\w+)$", full_citation):
            continue

        if isinstance(mounce_morphcat, list):
            mounce_morphcat = ";".join(mounce_morphcat)
        success = False

        for end, cat, dodson in MATCHES:
            if (
                full_citation and mounce_morphcat and
                re.search(end, strip_accents(full_citation)) and
                re.search(cat, mounce_morphcat) and
                re.search(dodson, dodson_pos)
            ):
                success = True
        if success:
            success_count += 1
        else:
            fail_count += 1
            print(lexeme)
            if not first_fail:
                first_fail = '(r"^{}$", r"^{}$", r"^{}$"),  # {} '.format(
                    strip_accents(full_citation),
                    mounce_morphcat, dodson_pos, lexeme)

print(success_count, fail_count)
print(first_fail)
